cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
#ifdef DEBUG_PRINT    
    Serial.print("Read ");
    Serial.print(bytesRead);
    Serial.print(" bytes into RAM_Disk ");
    Serial.println(DriveNumber);
#endif
    f.close();
    

    return true;
}

bool SaveConfigToSD(void) 
{
    if (!SD_Card_Mounted)
    {
      return false;
    }

    File f = SD_MMC.open("/config.ccc", FILE_WRITE);
    if (!f) {
        Serial.println("Failed to open /config.ccc for writing");
        return false;
    }

    for (int i = 0; i < 4; i++) 
    {
        size_t written = f.write(Disk_Drive.Name_Disk[i], 256);
        if (written != 256) 
        {
            Serial.printf("Write failed for disk %d\n", i);
            f.close();
            return false;
        }
    }

    f.close();
    Serial.println("Configuration saved to SD");
    return true;
}

bool LoadConfigFromSD(void)
{
    if (!SD_Card_Mounted)
    {
      return false;
    }

    File f = SD_MMC.open("/config.ccc", FILE_READ);
    if (!f) 
    {
        Serial.println("Failed to open /config.ccc for reading");
        return false;
    }

    for (int i = 0; i < 4; i++) 
    {
        size_t readBytes = f.read(Disk_Drive.Name_Disk[i], 256);
        if (readBytes != 256) 
        {
            Serial.printf("Read failed for disk %d\n", i);
            f.close();
            return false;
        }
    }

    f.close();
    Serial.println("Configuration loaded from SD");
    return true;
}


bool WriteCP400DiskImage(const char* filename, uint8_t DriveNumber)
{
  //return true;
  if (!SD_Card_Mounted)
  {
    return false;
  }

  size_t bytesWritten = 0;
    
    
    File f = SD_MMC.open(filename, FILE_WRITE);
    if(!f)
    {
#ifdef DEBUG_PRINT    
      Serial.print("Failed to open file for writing: ");
      Serial.println(filename);
#endif
      return false;
    }

    switch(DriveNumber)
    {
        case 0:
            bytesWritten = f.write(RAM_Disk0, DISK_SIZE);
        break;

        case 1:
            bytesWritten = f.write(RAM_Disk1, DISK_SIZE);
        break;

        case 2:
            bytesWritten = f.write(RAM_Disk2, DISK_SIZE);
        break;

        case 3:
        bytesWritten = f.write(RAM_Disk3, DISK_SIZE);
        break;

        default:
#ifdef DEBUG_PRINT    
        Serial.println("Invalid DriveNumber");
#endif
        f.close();
        return false;
    }

    f.flush();     // force physical write
    f.close();

#ifdef DEBUG_PRINT    
    Serial.print("Written ");
    Serial.print(bytesWritten);
    Serial.print(" bytes from RAM_Disk ");
    Serial.println(DriveNumber);
#endif
    return (bytesWritten == DISK_SIZE);
}




cpu_t cpu;

void DoCPU(void)
{
  //Debug1Toggle();
  
  if (CPU_in_WAIT_STATE)
  {
    if (sf.CPU_HALTED_BY_EMULATOR) //If Emulator is in Menus, 
    {
      return;
    }
    
    if (gpio_get_level(VSYNC_PORT) != 0)  //Manage CWAI instruction
    {
      return;
    }
    else
    {
      CPU_in_WAIT_STATE = false;
    }
  }
  //Debug1Toggle();
  
  cpu.execute();
  cpu.execute();
  if (sf.CPU_Speed == CPU_FAST)
  {
    cpu.execute();
    cpu.execute();
  }

  return;
}

void CopyDiskToRamDisk(void)
{
  if (!SD_Card_Mounted)
  {
    return;
  }

  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[0], 0);
  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[1], 1);
  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[2], 2);
  ReadCP400DiskImage((const char*)Disk_Drive.Name_Disk[3], 3);
  
}



  const PinConfig pins(-1,-1,-1,5,4,  -1,-1,-1,-1,7,6,  -1,-1,-1,9,8,  2,1);
//                             B B X       G  G  X         R  R
    //6 bit mode for Coco 3    0 1 X       0  1  X         0  1

VGA* vga;
GfxWrapper<VGA> *gfx;


Mode mode0 = Mode::MODE_320x240x60;
Mode mode1 = Mode::MODE_320x240x60_4_3;
Mode mode2 = Mode::MODE_640x240x60;
Mode mode3 = Mode::MODE_640x240x60_4_3;

#ifndef VIDEO_Y_OFFSET
#define VIDEO_Y_OFFSET 24
#endif

#if VIDEO_Y_OFFSET < 0 || VIDEO_Y_OFFSET > 48
#error "VIDEO_Y_OFFSET must be between 0 and 48"
#endif

constexpr uint16_t VIDEO_ACTIVE_HEIGHT = 192;



uint8_t SCAN_Keyboard_Matrix[8][7];


uint8_t ReadCP400Buttons(void)
{
  uint8_t val1, val2;
  val1 = USB_DEV_CONTROL.JOY1_BUTT1;
  val2 = USB_DEV_CONTROL.JOY2_BUTT1<<1;

  return val1 | val2;
  
}

void InitSD_Card1(void)
{
  SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
  if (!SD_MMC.begin("/sdcard", true, false, SDMMC_FREQ_DEFAULT, 5)) 
  {
    Serial.println("Card Mount Failed");
    return;
  }

 file = SD_MMC.open("/GAMES01.DSK", FILE_READ);
  if (!file)
  {
    Serial.println("Failed to open /GAMES01.DSK");
    return;
  }
  else
  {
    Serial.println("File Correct");
  }
  while(1)
  {

  }
}
extern void flashFromSD(const char* filename);
void CheckFirmwareUpdate(void)
{
  if (!SD_Card_Mounted)
  {
    return;
  }

  debugln("Before flash");
  flashFromSD("/qprcx.rty");  //Random name for flash file (Created from the Flash menu).  Will be ereased after flash.
}


void InitSD_Card(void)
{

  SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);
  
  if (!SD_MMC.begin("/sdcard", true, false, SDMMC_FREQ_DEFAULT, 5)) {
    SD_Card_Mounted = false;
    debugln("Card Mount Failed");
    return;
  }
  uint8_t cardType = SD_MMC.cardType();
  if(cardType == CARD_NONE){
    SD_Card_Mounted = false;
    debugln("No SD_MMC card attached");
    return;
  }

  SD_Card_Mounted = true;

  Serial.print("SD_MMC Card Type: ");
  if(cardType == CARD_MMC){
    debugln("MMC");
  } else if(cardType == CARD_SD){
    debugln("SDSC");
  } else if(cardType == CARD_SDHC){
    debugln("SDHC");
  } else {
    debugln("UNKNOWN");
  }

}

#define BOARD_CASSETTE_OUT 13
#define BOARD_CASSETTE_IN 14
#define BOARD_CASSETTE_RELAY 10

#define ROM_OFFSET 0x8000
#define RAM_MODE 0x0000
void InitPeripherals_and_Others(void)
{
  

  for(uint32_t i = 0; i !=65536; i++)
  {
      memory[i] = 255;
  }
  
  Serial.begin(115200);
  delay(10);
  
  InitSD_Card();
  
  CheckFirmwareUpdate();
  
  
  InitDisks();

  cpu.assign_nmi_line(&sf.nmi_pin);
  cpu.assign_firq_line(&sf.firq_pin);
  cpu.assign_irq_line(&sf.irq_pin);

  
