cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
  //------Special registers------
  sf.CPU_HALTED_BY_EMULATOR = false;
  sf.DIRECT_Key_Code = 0;  //Nothing
  sf.PHYSICAL_Drive_Must_Be_Saved = false;
  sf.V_Synch_Int_Enabled = false;
  sf.nmi_pin = true;  //True = disabled
  sf.firq_pin = true; //True = disabled
  sf.irq_pin = true; //True = disabled
  sf.V_Synch = false;
  sf.CP400_32K_UPPER_ENABLED = false;
  sf.ROM_Offset = ROM_OFFSET;
  sf.AnyKeypress = false; //Used for Keyboard Scan.
  
  sf.CPU_Speed = CPU_SLOW;
  sf.CP400VideoGenMODE = 255;    //To reset in first execution
  sf.CP400VideoPageOffset_Registers = 0b00000010; //Init to be at address 400 (Even if Basic set it at boot)
  sf.CP400ColorMode = 0;
  sf.VideoEmulatorXpixels = 320;
  sf.Artefact = true; //Artefact mode by default.
  sf.CP400GraphicMode = 0;

  sf.is_JOY1_B1_WasPressed = false;
  sf.is_JOY1_B2_WasPressed = false;
  sf.is_JOY2_B1_WasPressed = false;
  sf.is_JOY2_B2_WasPressed = false;
  sf.is_LastKeyboardScanned = false;
//------------Init of Disk Registers------

  DiskAccess.IsinReadProcess = false;
  DiskAccess.IsInWriteProcess = false;
  DiskAccess.NMI_Int_Started = false;
  DiskAccess.NMI_Delay = 0;

  InitPorts();

  
  
  CopyCP400ROMS();
  //CopyCoCo3ROMS();
	
  CopyDiskToRamDisk();
  
  vga = new VGA();
  gfx = new GfxWrapper<VGA>(*vga, mode1.hRes, mode1.vRes);
  vga->bufferCount = 2;
	if(!vga->init(pins, mode1, 8)) while(1) delay(1);
	vga->start();

  SetVideoMode(VIDEO_MODE_320X240_4_3);
  for (int y = 0; y < mode1.vRes; y++)
  {
    for (int x = 0; x < mode1.hRes; x++)
    {
      if (x < mode1.hRes / 4)
      {
        vga->dot(x, y, vga->rgb(255, 255, 255));
      }
      else if (x < mode1.hRes / 2)
      {
        vga->dot(x, y, vga->rgb(255, 0, 0));
      }
      else if (x < (mode1.hRes * 3) / 4)
      {
        vga->dot(x, y, vga->rgb(0, 255, 0));
      }
      else
      {
        vga->dot(x, y, vga->rgb(0, 0, 255));
      }
    }
  }
  vga->show();
  //SetVideoMode(MODE_320x240x60_4_3);
  //SetVideoMode(VIDEO_MODE_320X240_16_9);
  //SetVideoMode(VIDEO_MODE_640X240_16_9);
  //SetVideoMode(VIDEO_MODE_640X240_4_3);

}

void InitPorts(void)
{
  ledcSetup (0, 40000, 8);  // PWM Sound Configuration
  ledcAttachPin(47, 0);                   //
  ledcWrite(0,127);


  //analogReadResolution(8);
  //int initval = analogRead(BOARD_CASSETTE_IN);
  //adc1_config_channel_atten(ADC1_CHANNEL_6, ADC_ATTEN_DB_0); // 0-1.1V
  
  //pinMode(BOARD_CASSETTE_OUT,OUTPUT);
  //pinMode(BOARD_CASSETTE_RELAY, OUTPUT);
  //digitalWrite(BOARD_CASSETTE_RELAY, LOW);  //Disable Relay.

  return;
}
void SetVideoMode(uint8_t VideoMode)
{
  vga->stop();
  switch (VideoMode)
  {
  case VIDEO_MODE_320X240_16_9:
    sf.VideoEmulatorXpixels = 320;
    if(!vga->Reinit(pins, mode0, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_320X240_4_3:
      sf.VideoEmulatorXpixels = mode1.hRes;
      if(!vga->Reinit(pins, mode1, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_640X240_16_9:
      sf.VideoEmulatorXpixels = 640;  
      if(!vga->Reinit(pins, mode2, 8)) while(1) delay(1);
    break;
    case VIDEO_MODE_640X240_4_3:
      sf.VideoEmulatorXpixels = 640;  
      if(!vga->Reinit(pins, mode3, 8)) while(1) delay(1);
    break;
  
  default:
    break;
  }
  vga->start();

}



const int Field_Synch_Interrupt_PIN = VSYNC_PORT;  // VSynch pin


void IRAM_ATTR Field_Synch_Interrupt_Flag() 
{
  /*
    This interrupt is tied to the Vertical Pin of the ESP32
    and is used to update the Field interrupt flag of FF03 bit 7.
    A read of FF02 reset this flag (1 = reset 0 = set)
  
    */

  rom[ROM_FF03] |= 0b10000000;  //Set bit 7

  if (sf.V_Synch_Int_Enabled)
  {
    sf.irq_pin = false;  //Interrupt enabled.
  }
  sf.V_Synch = true;
  //Debug2Toggle();

}


/*

---------------------------------
FF22:
Resolution Selection
F8 = Pmode 4 256x192 2 colors 11111XXX
E8 = Pmode 3 128x192 4 colors 11101XXX
D8 = pmode 2 128x192 2 colors 11011XXX
C8 = pmode 1 128x96  4 colors 11001XXX
B8 = pmode 0 128x96  2 colors 10111XXX

--SAM CONTROL REGISTERS:




76543210
||||||||_RS232 DATA INPUT
|||||||__SINGLE BIT SOUND OUTPUT
||||||___RAM SIZE INPUT
|||||____VDG CSS -Color set (0 = white, 1 = green)
||||_____VDG GM0
|||______VDG GM1
||_______VDG GM2
|________VDG _A/G

SCREEN X,X 
       | |_____COLOR SET     0 = COLOR SET 1  1 = COLOR SET 2
       |_______DISPLAY MODE  0 = TEXT 1 = GRAPHIC


Mode VDG Settings SAM
                      A/G GM2 GM1 GM0 V2/V1/V0    Desc.   RAM used x,y,clrs in hex(dec)
Internal alphanumeric  0   X   X   0   0  0  0    32x16 ( 5x7 pixel ch)
External alphanumeric  0   X   X   1   0  0  0    32x16 (8x12 pixel ch)
Semigraphic-4          0   X   X   0   0  0  0    32x16 ch, 64x32 pixels
Semigraphic-6          0   X   X   1   0  0  0    64x48 pixels
Full graphic 1-C       1   0   0   0   0  0  1    64x64x4 $400(1024)
Full graphic 1-R       1   0   0   1   0  0  1   128x64x2 $400(1024)
Full graphic 2-C       1   0   1   0   0  1  0   128x64x4 $800(2048)
Full graphic 2-R       1   0   1   1   0  1  1   128x96x2 $600(1536)
Full graphic 3-C       1   1   0   0   1  0  0   128x96x4 $C00(3072)
Full graphic 3-R       1   1   0   1   1  0  1   128x192x2 $C00(3072)
Full graphic 6-C       1   1   1   0   1  1  0   128x192x4 $1800(6144)
Full graphic 6-R       1   1   1   1   1  1  0   256x192x2 $1800(6144)
Direct memory access   X   X   X   X   1  1  1

- The graphic modes with -C are 4 color, -R is 2 color.
- 2 color mode - 8 pixels per byte (each bit denotes on/off)
4 color mode - 4 pixels per byte (each 2 bits denotes color)
- CSS (in FF22) is the color select bit:
Color set 0: 0 = black, 1 = green for -R modes
00 = green, 01 = yellow for -C modes
10 = blue, 11 = red for -C modes
Color set 1: 0 = black, 1 = buff for -R modes


*/

bool IsButtonPressed(void)
{
  if (digitalRead(21) == true)
  {
    return false;
  }
  else
  {
    return true;
  }
}
uint8_t debugloop = 0;

hw_timer_t* cpuTimer = NULL;
portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;

uint32_t testloop1 = 0;

void IRAM_ATTR onCPUTimer() 
{
  
  Debug1Toggle();
  cpu.execute(); 
  cpu.execute(); 
  testloop1++;
  if (testloop1 == 20000)
  {
    testloop1 = 0;
  }
  
  
