cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
}

void setTimerInterval(uint32_t newInterval) //To set Slow/Fast CPU speed
{
  // Disable actual alarm
  timerAlarmDisable(cpuTimer);
  
  // Change timer interval
  timerAlarmWrite(cpuTimer, newInterval, true);  // newInterval est le nombre de ticks
  
  // Réactiver l'alarme
  timerAlarmEnable(cpuTimer);
}

uint8_t ReadJoysticks(uint8_t JoyNum)
{
  

    switch (JoyNum)
  {
  case JOY_RX:
    return USB_DEV_CONTROL.JOY1_X_AXIS;
    break;
  case JOY_RY:
    return USB_DEV_CONTROL.JOY1_Y_AXIS;
    break;
  case JOY_LX:
    return USB_DEV_CONTROL.JOY2_X_AXIS;
    break;
  case JOY_LY:
    return USB_DEV_CONTROL.JOY2_Y_AXIS;
    break;
  
  default:
    break;
  }
  return 255; 
}


//initial setup


void setup()
{
  
  
  pinMode(DEBUG1,OUTPUT);
  pinMode(DEBUG2,OUTPUT);
  pinMode(LED_PORT_ANODE,OUTPUT);
  pinMode(LED_PORT_CATHODE,OUTPUT);




  InitPeripherals_and_Others();

  DISKETTE_LED_OFF();

#define SERIAL1_TX 41
#define SERIAL1_RX 42
#define SERIAL1_BAUD 115200

  Serial1.begin(SERIAL1_BAUD, SERIAL_8N1, SERIAL1_RX, SERIAL1_TX);



  cpu.reset();

  Setup_USB();


  xTaskCreatePinnedToCore
  (
    VideoCore,        // Fonction
    "SystemCore",      // Name
    6048,              // stack
    NULL,              // Parameter
    2,                 // Priority
    NULL,              // Handle 
    1                  // CPU 0 or 1
  );

}


void loop()
{
  //Nothig to do here, all the work is in ISR and RTOS
}


#define CP400_GRAPH_MODE_32X16_8X12 0b0 //Text 32x16
#define CP400_GRAPH_MODE_256X192X2 0b11110110  //PMODE 4
#define CP400_GRAPH_MODE_128X192X4 0b11100110  //PMODE 3  OK


#define CP400_GRAPH_MODE_128X192X2 0b11010101  //PMODE 2
#define CP400_GRAPH_MODE_128X96X4 0b11000100  //PMODE 1
#define CP400_GRAPH_MODE_128X96X4_1 0b11110100  //PMODE 1 Other mode??


#define CP400_GRAPH_MODE_128X96X2 0b10110011  //PMODE 0


//---------Other modes in assembly language only, not officialy supported in Basic CP400
#define CP400_GRAPH_MODE_128X64X4 0b10100010  //
#define CP400_GRAPH_MODE_128X64X2 0b10010001  //

#define CP400_GRAPH_MODE_64X64X4 0b10000001  //


#ifdef DEBUG_ALL
#define WAIT_VSYNCH_LOW()  while(gpio_get_level(VSYNC_PORT) != 0) {DEBUG1_SET;}DEBUG1_CLR
#else
#define WAIT_VSYNCH_LOW()  while(gpio_get_level(VSYNC_PORT) != 0) {}
#endif
#define X_OFFSET_32 312
void IRAM_ATTR VideoCore(void *pvParameters) 
{
  uint8_t ModeValue;
  while (true) 
  {
    //vTaskDelay(1);
    if (sf.DIRECT_Key_Code == MENU_F12) //Emulator menu entrance
    {
      
      CPU_in_WAIT_STATE = true;
      sf.CPU_HALTED_BY_EMULATOR = true;
      vTaskDelay(1);

      EMULATOR_Menu();
      CPU_in_WAIT_STATE = false;
      sf.CPU_HALTED_BY_EMULATOR = false;
      vTaskDelay(200);
    }
    



    ModeValue = sf.CP400GraphicMode & 0b11110111;    //Remove the Color bit
    
    switch (ModeValue)
    {
    
      case CP400_GRAPH_MODE_32X16_8X12:
        RenderCP400GraphMode_32X16_8X12();
      break;

      case CP400_GRAPH_MODE_256X192X2:
        if (sf.Artefact)
        {
          RenderCP400GraphMode_256X192X2_Artefact();
        }
        else
        {
          RenderCP400GraphMode_256X192X2();
        }
      break;

      case CP400_GRAPH_MODE_128X192X4:
        RenderCP400GraphMode_128X192X4();
      break;

      case CP400_GRAPH_MODE_128X192X2:
        RenderCP400GraphMode_128X192X2();
      break;

      case CP400_GRAPH_MODE_128X96X4:
      case CP400_GRAPH_MODE_128X96X4_1:
      RenderCP400GraphMode_128X96X4();
      break;

      case CP400_GRAPH_MODE_128X96X2:
        RenderCP400GraphMode_128X96X2();
      break;

      case CP400_GRAPH_MODE_128X64X4:
        RenderCP400GraphMode_128X64X4();
      break;

      case CP400_GRAPH_MODE_128X64X2:
        RenderCP400GraphMode_128X64X2();
    break;

    case CP400_GRAPH_MODE_64X64X4:
      RenderCP400GraphMode_64X64X4();
break;

      
      
      default:
      break;
    }

    
    
    /*
    while (!sf.V_Synch) //While no interrupt
    {
      //vTaskDelay(1);
      NOP();
    }*/


    WAIT_VSYNCH_LOW();
    Field_Synch_Interrupt_Flag();
  
    vga->show();
    
    if (sf.PHYSICAL_Drive_Must_Be_Saved)
    {
      DISKETTE_LED_ON();
      WriteCP400DiskImage((const char*)Disk_Drive.Name_Disk[DiskAccess.DriveSelected],DiskAccess.DriveSelected);
      DISKETTE_LED_OFF();
      sf.PHYSICAL_Drive_Must_Be_Saved = false;
    }

    FillKeyboardMatrix();
  }
}


void RenderCP400GraphMode_64X64X4(void)
{


  if (sf.CP400VideoGenMODE != CP400_GRAPH_MODE_64X64X4)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();

    sf.CP400VideoGenMODE = CP400_GRAPH_MODE_64X64X4;
  }




  
  uint32_t MemLoop = sf.CP400VideoPageOffset_Registers * CP400_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop, Yloop1;
  uint8_t Dot1bit[8];
  uint8_t Color[4];
  
  if ((sf.CP400GraphicMode & 0b00001000) == 0)
  {
    Color[0] = 0b00011100;  //Green
    Color[1] = 0b11111100;  //Yellow
    Color[2] = 0b00000011;  //Blue
    Color[3] = 0b11100000;  //Red
  }
  else
  {
    Color[0] = 0xff; //blanc
    Color[1] = 0b01011011;  //Turquoise
    Color[2] = 0b11100011;  //lilas
    Color[3] = 0b11101000;  //orange(buff)
  }  

  for (Yloop = VIDEO_Y_OFFSET; Yloop < VIDEO_Y_OFFSET + VIDEO_ACTIVE_HEIGHT; Yloop+=3)
  {
        for (Xloop = 32; Xloop <288 ; Xloop+=16)
    {

      Dot1bit[3] = (memory[MemLoop] >> 6) & 0b11;  // Bits 6-7
      Dot1bit[2] = (memory[MemLoop] >> 4) & 0b11;  // Bits 4-5
      Dot1bit[1] = (memory[MemLoop] >> 2) & 0b11;  // Bits 2-3
      Dot1bit[0] = (memory[MemLoop++] >> 0) & 0b11;  // Bits 0-1

      //Line one
      vga->dot(Xloop,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+1,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+2,Yloop, Color[Dot1bit[3]]);
      vga->dot(Xloop+3,Yloop, Color[Dot1bit[3]]);

      vga->dot(Xloop+4,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+5,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+6,Yloop, Color[Dot1bit[2]]);
      vga->dot(Xloop+7,Yloop, Color[Dot1bit[2]]);

      vga->dot(Xloop+8,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+9,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+10,Yloop, Color[Dot1bit[1]]);
      vga->dot(Xloop+11,Yloop, Color[Dot1bit[1]]);

      vga->dot(Xloop+12,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+13,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+14,Yloop, Color[Dot1bit[0]]);
      vga->dot(Xloop+15,Yloop, Color[Dot1bit[0]]);

