cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
    }
  }
}

void IRAM_ATTR RenderCP400GraphMode_256X192X2_Artefact(void)
{
  if (sf.CP400VideoGenMODE != CP400_GRAPH_MODE_256X192X2)
  {
    vga->clear(0b11111111);
    vga->show();
    vga->clear(0b11111111);
    vga->show();
    sf.CP400VideoGenMODE = CP400_GRAPH_MODE_256X192X2;
    
  }
  uint32_t MemLoop = sf.CP400VideoPageOffset_Registers * CP400_GRAPH_OFFSET_LEN;
  uint16_t Xloop, Yloop;
  uint8_t Dot1bit[8];
  uint8_t Color[4];
  uint16_t DotCount = 0;
  uint16_t Xcount;
  uint8_t BitCount;
  bool NoBlackFlag = false;
  Color[0] = 0b00000000;  // Black
  Color[2] = 0b11100000;  // Red
  Color[1] = 0b00000011;  // blue
  Color[3] = 0b11111111;  // White
  uint8_t LinePrep[266];
  uint16_t LinePrepLoop;
  for (Yloop = VIDEO_Y_OFFSET; Yloop < VIDEO_Y_OFFSET + VIDEO_ACTIVE_HEIGHT; Yloop++)
  {
    Xcount = 0;
    DotCount = 0;
    LinePrepLoop = 0;

    for (Xloop = 32; Xloop <288 ; Xloop+=8)
    {
      Dot1bit[0] = ((memory[MemLoop]>>7) & 0b00000001);
      Dot1bit[1] = ((memory[MemLoop]>>6) & 0b00000001);
      Dot1bit[2] = ((memory[MemLoop]>>5) & 0b00000001);
      Dot1bit[3] = ((memory[MemLoop]>>4) & 0b00000001);
      Dot1bit[4] = ((memory[MemLoop]>>3) & 0b00000001);
      Dot1bit[5] = ((memory[MemLoop]>>2) & 0b00000001);
      Dot1bit[6] = ((memory[MemLoop]>>1) & 0b00000001);
      Dot1bit[7] = (memory[MemLoop++] & 0b00000001);
      
      //---The following 8 ittération used without loop for optimisation.  
      //   With FOR LOOP 0 to 7, ther is not enough time to fill the video page before the Vsynch occur
      //   --All the optimisations are validated with an oscilloscope and does the job quite well.
      BitCount = 0;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }
        

      BitCount = 1;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

      BitCount = 2;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

      BitCount = 3;
      if (Dot1bit[BitCount]==1)
        {
          DotCount++; 
          if ((Xloop + BitCount & 0b00000001))    //Check if dot is pair or impair
          {
            LinePrep[LinePrepLoop + BitCount] = Color[1];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[1];
            
            NoBlackFlag = true;
          }
          else
          {
            LinePrep[LinePrepLoop + BitCount] = Color[2];
            LinePrep[LinePrepLoop + BitCount + 1] = Color[2];
            NoBlackFlag = true;
          }
          if (DotCount >1)
          {
            LinePrep[LinePrepLoop + BitCount - 1] = Color[3];
            LinePrep[LinePrepLoop + BitCount] = Color[3];
            NoBlackFlag = true;
          }
        }
        else
        {
          if (NoBlackFlag ==false)
          {
            LinePrep[LinePrepLoop + BitCount] = Color[0];
            LinePrep[LinePrepLoop + BitCount - 1] = Color[0];
          }
          DotCount = 0;  //Reset the DotCount That make Artefact possible if value is 2 or more
          NoBlackFlag = false;
        }

