cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
// Optional CoCo 3 ROM loader, kept for compatibility/reference; not part of
// the active CP400 emulation path (see CopyCP400ROMS()).
void CopyCoCo3ROMS(void)
{
  uint32_t LoopRom1, LoopRam1, LoopRomSource;

  LoopRam1 = 0x8000;  //coco3p
  for (LoopRom1 = 0; LoopRom1 != 8192 * 3; LoopRom1++)
  {
    memory[LoopRam1++] = coco3[LoopRom1];
  }

  LoopRam1 = 0xc000;  //disk11
  for (LoopRom1 = 0; LoopRom1 != 8192; LoopRom1++)
  {
    memory[LoopRam1++] = disk11[LoopRom1];
  }

 
    // Copy de memory[0x8000 - 0xFFFF] to rom[0 - 0x7FFF]
    LoopRomSource = 0;
    for (LoopRam1 = 0x8000; LoopRam1 < 0x10000; LoopRam1++)
    {
      rom[LoopRomSource++] = memory[LoopRam1];
    }

    
 
  return;
}

/*
DRQ = 1 when the Computer can read data or write data to the register.
DRQ is 0 when is busy.
*/

#define MACRO_TRACK_R DiskAccess.DSK_FILE_DataPTR = (DiskAccess.TrackPos * 18 * 256) + ((DiskAccess.SectorPos - 1) * 256)
#define MACRO_TRACK_W DiskAccess.DSK_FILE_DataPTR = (DiskAccess.TrackPos * 18 * 256) + ((DiskAccess.SectorPos - 1) * 256)
#define M_DRQ_BIT_READY 0b00000010
  
  
  
void ManagePeripherals_Read(uint16_t address)
{
  
  
  if (DiskAccess.NMI_Delay >0)
  {
    DiskAccess.NMI_Delay--;
    if (DiskAccess.NMI_Delay==2)
    {
      sf.nmi_pin = false;  //NMI Started
    }

    if (DiskAccess.NMI_Delay == 1)
    {
      sf.nmi_pin = true;  //NMI Stopped

    }


  }


  //Manage all the read operation of memory addresses
  switch (address)
  {
    case M_FF02: //ROM_FF02:
      rom[ROM_FF03] &= 0b01111111;  //If ff02 Address is read, it reset the Vsynch interrupt flag AT ff03.
      if (sf.V_Synch_Int_Enabled)
      {
        sf.irq_pin = true;  //Interrupt Disabled.
      }
      sf.V_Synch = false; 

      break;
      //All next are drive related--------------------------

      
    case M_FF00: //ROM_FF02:

    uint8_t val1, buttons, tmp1;
    uint8_t MultiplexerCB2_CA2;
    if (true)  
    {
      ManageKeyboardScan(rom[ROM_FF02]);
      //Do the joystick stuff first
      buttons = ReadCP400Buttons();
      
      if ((buttons & 0b00000001) == 0)
      {
        //Serial.print("JO");
        sf.is_JOY1_B1_WasPressed=true;
        rom[ROM_FF00] &=0b11111110;
      }
      else
      {

        if (!sf.is_LastKeyboardScanned)
        {
          rom[ROM_FF00] |=0b00000001;
        }
        else
        {
          sf.is_LastKeyboardScanned = false;
        }
      }

      if ((buttons & 0b00000010) == 0)
      {
        
        rom[ROM_FF00] &=0b11111101;
      }
      
      
    
      MultiplexerCB2_CA2 = (((rom[ROM_FF03] & 0b00001000)>>2) | ((rom[ROM_FF01] & 0b00001000)>>3));   //Get the two bits Comparator Selection
      val1 = ReadJoysticks(MultiplexerCB2_CA2);   //Sample Requested joystick
      
      if (val1 > (rom[ROM_FF20] & 0b11111100))
      {
        rom[ROM_FF00] |= 0b10000000;

      }
      else
      {
        rom[ROM_FF00] &= 0b01111111;

      }

    }
    else //Manage Keyboard
    {
      uint8_t val1;
      ManageKeyboardScan(rom[ROM_FF02]);
    }

    

      break;


    case M_FF48: 

      if (DiskAccess.IsinReadProcess)   //If Disk Access transaction;
      {
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Will step the ASM routine to read the next Byte
      }
      else
      {
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Always no error
      }

    break;    //error here, this is why the next block works
    case  M_FF4B:
      
    if (DiskAccess.IsinReadProcess)
    {
      
      DiskAccess.DriveSelected = GetDriveNumber(rom[ROM_FF40]);
      if (DiskAccess.DriveSelected != Disk_Drive.LastNumber_Accessed)
      {
        Disk_Drive.LastNumber_Accessed = DiskAccess.DriveSelected;
        if (Disk_Drive.isFileAlreadyOpen)
        {
          //file.close(); //Close the actual
        }


        Disk_Drive.isFileAlreadyOpen = true;
      }
      rom[ROM_FF4B] = ReadDiskByte(DiskAccess.DSK_FILE_DataPTR);  //RAM_Disk[DiskAccess.DSK_FILE_DataPTR++];
      DiskAccess.DSK_FILE_DataPTR++;
      DiskAccess.RW_Process_ByteRemainingCounter--;
      if (DiskAccess.RW_Process_ByteRemainingCounter==0)
      {
        rom[ROM_FF48] = 0;
        DiskAccess.IsinReadProcess = false;
        DISKETTE_LED_OFF();
        DiskAccess.NMI_Delay = 4;
        sf.nmi_pin = false;  //NMI Started
        
      }
    }
    else
    {
      Disk_Drive.isFileAlreadyOpen = false;
      //file.close();  //Close the actual
      Disk_Drive.LastNumber_Accessed = 254;
    }
    break;


    default:
    break;
  }
  //return rom[address-0xff40];
}


uint8_t ReadDiskByte(uint32_t BytePos)
{
  uint8_t ByteRead;
  switch (DiskAccess.DriveSelected)
  {
  case 0:
  ByteRead = RAM_Disk0[BytePos];
  break;
  case 1:
  ByteRead = RAM_Disk1[BytePos];
  break;
  case 2:
  ByteRead = RAM_Disk2[BytePos];
  break;
  case 3:
  ByteRead = RAM_Disk3[BytePos];
  break;
  
  default:
    break;
  }
  return ByteRead;
}

void WriteDiskByte(uint32_t BytePos, uint8_t ByteData)
{

  switch (DiskAccess.DriveSelected)
  {
  case 0:
    RAM_Disk0[BytePos] = ByteData;
  break;
  case 1:
    RAM_Disk1[BytePos] = ByteData;
  break;
  case 2:
    RAM_Disk2[BytePos] = ByteData;
  break;
  case 3:
    RAM_Disk3[BytePos] = ByteData;
  break;
  
  default:
    break;
  }


}


uint8_t MountFileSystem(void)
{
  if (!SD_MMC.begin())
    return 2; // No Card / init fail

  uint8_t cardType = SD_MMC.cardType();
  if (cardType == CARD_NONE)
    return 3; // No media

  return 0;
}

uint8_t GetDriveNumber(uint8_t Address)
{
  uint8_t tmpDrive = 0;
  if (Address & 0b00000001)
  {
    tmpDrive = 0;
  }
  else if (Address & 0b00000010)
  {
    tmpDrive = 1;
  }
  else if (Address & 0b00000100)
  {
    tmpDrive = 2;
  }
  else if (Address & 0b01000000)
  {
    tmpDrive = 3;
  }
  return tmpDrive;  
}


void InitDisks(void)
{
  memset(Disk_Drive.Name_Disk, 0, sizeof(Disk_Drive.Name_Disk));
  
  LoadConfigFromSD();

  Disk_Drive.Name_Disk[0][255] = 0; //Just to be sure.
  Disk_Drive.Name_Disk[1][255] = 0; //Just to be sure.
  Disk_Drive.Name_Disk[2][255] = 0; //Just to be sure.
  Disk_Drive.Name_Disk[3][255] = 0; //Just to be sure.

  Disk_Drive.LastNumber_Accessed = 255; //No Last Accessed
  Disk_Drive.isFileAlreadyOpen = false;

  Disk_Drive.Error = false;
  Disk_Drive.LastAccessType = 255;

  return;
}



  void DebugTrack(void)
  {
    Serial.print("T: ");
    Serial.print(rom[ROM_FF49]);
    Serial.print("  S: ");
    Serial.print(rom[ROM_FF4A]);
    Serial.print(" SF T:");
    Serial.print(DiskAccess.TrackPos);
    Serial.print(" SF S:");
    Serial.print(DiskAccess.SectorPos);
    Serial.print(" Data Pointer: ");
    Serial.print(DiskAccess.DSK_FILE_DataPTR);

