cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
    Serial.print(" PC: ");
    Serial.println(cpu.get_pc(),HEX);


    delay(40);
  }


  void ManagePeripherals_Write(uint16_t address, uint8_t value)
  {


    uint8_t tmpvar8t;
    uint16_t tmpvar16t;

    if (DiskAccess.NMI_Delay >0)
    {
      DiskAccess.NMI_Delay--;
      if (DiskAccess.NMI_Delay==2)
      {
        sf.nmi_pin = false;  //NMI Started

        rom[ROM_FF48] = 0;
      }

      if (DiskAccess.NMI_Delay == 1)
      {
        sf.nmi_pin = true;  //NMI Stopped
      }

    }




    switch (address)
    {
      case M_FF20:
        rom[ROM_FF20] = value;
        
        if ((rom[ROM_FF23] & 0b00001000)!=0)  //So, Sound is enabled
        {
          ledcWrite(0,value);
        }
      break;
    case M_FF02:
        ManageKeyboardScan(value);
        rom[ROM_FF02] = value;
      break;
    case M_FF03:
        if ((value & 0b00000001) == 0)
        {
          sf.V_Synch_Int_Enabled = false;
        }
        else
        {
          sf.V_Synch_Int_Enabled = true;
        }  
      break;

      case M_FFD9:
      Serial.println("F");
        sf.CPU_Speed = CPU_FAST;
      break;
      case M_FFD8:
      Serial.println("S");
      sf.CPU_Speed = CPU_SLOW;
      break;
//----------------Disk Related---------------
   case M_FF40:
    rom[ROM_FF40] = value;
    
    break;


#define DSKCMD_RESTORE 0x03
#define DSKCMD_SEEK 0x10
#define DSKCMD_STEP 0x20
#define DSKCMD_STEP_IN 0x40
#define DSKCMD_STEP_OUT 0x50
#define DSKCMD_READ_SECTOR 0x80
#define DSKCMD_WRITE_SECTOR 0xa0
#define DSKCMD_READ_ADDRESS 0xc0
#define DSKCMD_READ_TRACK 0xe0
#define DSKCMD_WRITE_TRACK 0xf0
#define DSKCMD_FORCE_INT 0xd0


    case M_FF48:
      if (value > 0b00001111)
      {
        value &=0b11110000;
      }
    
      rom[ROM_FF48] = value;
      #ifdef DEBUG_ALL
      Serial.print("Drive:");
      Serial.print(GetDriveNumber(rom[ROM_FF40]));
      Serial.print(" Track:");
      Serial.print(rom[ROM_FF49]);
      Serial.print(" Sec:");
      Serial.println(rom[ROM_FF4A]);
      Serial.print("FF48:");
      Serial.println(value,HEX);
      #endif
      DiskAccess.DRIVE_COMMAND = value;
      switch (value)
      {
        case DSKCMD_STEP:

        while(1)
        {
          //sleep(100);
        }    


        case DSKCMD_SEEK:
        rom[ROM_FF48] = 0;
        rom[ROM_FF49] = rom[ROM_FF4B];    //New Rom track is in Data register
        DiskAccess.TrackPos = rom[ROM_FF49];
        DiskAccess.SectorPos = rom[ROM_FF4A];
        break;
      case DSKCMD_RESTORE:
        DiskAccess.TrackPos = 0;
        DiskAccess.SectorPos = 0;
        rom[ROM_FF49] = 0;  //Track position 0
        rom[ROM_FF4A] = 0;  //Sector position 0
        rom[ROM_FF48] = 0;  //Always OK
        break;
      case DSKCMD_READ_SECTOR:
        DISKETTE_LED_ON();
        DiskAccess.IsinReadProcess = true;
        DiskAccess.RW_Process_ByteRemainingCounter = 257; //Init the loop counter for data to be transfered;
        DiskAccess.TrackPos = rom[ROM_FF49];
        DiskAccess.SectorPos = rom[ROM_FF4A];
        MACRO_TRACK_R;
        rom[ROM_FF48] = 0;  //Reset the bit
        
        break;
      
      case DSKCMD_STEP_IN:
        rom[ROM_FF49]+=1; 
        DiskAccess.TrackPos +=1;
        break;
      case DSKCMD_STEP_OUT:
        rom[ROM_FF49]-=1; 
        DiskAccess.TrackPos -=1;
        break;
      case DSKCMD_WRITE_SECTOR:
        DISKETTE_LED_ON();  
        DiskAccess.IsInWriteProcess = true;
        DiskAccess.RW_Process_ByteRemainingCounter = 257; //Init the loop counter for data to be transfered;
        DiskAccess.TrackPos = rom[ROM_FF49];
        DiskAccess.SectorPos = rom[ROM_FF4A];
        Serial.print("T:");
        Serial.print(rom[ROM_FF49]);
        Serial.print(" S:");
        Serial.println(rom[ROM_FF4A]);
        
        MACRO_TRACK_W;
        rom[ROM_FF48] = M_DRQ_BIT_READY;  //Reset the bit
        break;
      default:
        break;
      }
    break;
    case M_FF49:
      rom[ROM_FF49] = value;
      DiskAccess.TrackPos = value;
      rom[ROM_FF48] = M_DRQ_BIT_READY;
      break;

    case M_FF4A:
      rom[ROM_FF4A] = value;
      DiskAccess.SectorPos = value;
      rom[ROM_FF48] = M_DRQ_BIT_READY;
    break;



  case  M_FF4B:
    rom[ROM_FF4B] = value;
    if (DiskAccess.IsInWriteProcess)
    {
      if (DiskAccess.RW_Process_ByteRemainingCounter<258)   //Skip the first write (Not valid)
      {
        if (DiskAccess.DriveSelected != Disk_Drive.LastNumber_Accessed)
        {
          Disk_Drive.LastNumber_Accessed = DiskAccess.DriveSelected;
          if (Disk_Drive.isFileAlreadyOpen)
          {
            //file.close(); //Close the actual
          }
          Disk_Drive.isFileAlreadyOpen = true;
        }

        //Serial.print("W");
        WriteDiskByte(DiskAccess.DSK_FILE_DataPTR, rom[ROM_FF4B]);
        DiskAccess.DSK_FILE_DataPTR++;
        rom[ROM_FF48] = M_DRQ_BIT_READY;
      }
      else
      {
      }
      DiskAccess.RW_Process_ByteRemainingCounter--;

      if (DiskAccess.RW_Process_ByteRemainingCounter==1)
      {
        DiskAccess.RW_Process_ByteRemainingCounter = 0;
        //file.flush(); 
        DISKETTE_LED_OFF();
        
        sf.PHYSICAL_Drive_Must_Be_Saved = true; //Flag to request a File save (can't do it in Fotwrare Interrupt)
        rom[ROM_FF48] = M_DRQ_BIT_READY;

        DiskAccess.IsInWriteProcess = false;
        DiskAccess.NMI_Delay = 4;
        sf.nmi_pin = false;  //NMI Started
        Disk_Drive.isFileAlreadyOpen = false;

        Disk_Drive.LastNumber_Accessed = 254;
        
      }
    }
    else
    {
      Disk_Drive.isFileAlreadyOpen = false; //ADDED

      Disk_Drive.LastNumber_Accessed = 254; //ADDED
      
      
      rom[ROM_FF4B] = value;
      DiskAccess.DataRegisterValue = value;
      rom[ROM_FF48] = M_DRQ_BIT_READY;
    }
    break;


//------------All the next logic is for videomodes---------------------
    case M_FF22:
      
      

      rom[ROM_FF22] = value;
      sf.CP400GraphicMode = (sf.CP400GraphicMode & 0b00000111) | (value & 0b11111000);
      
      break;


      //In the next decode, no need to store data at address because it's only set reset.  Address are not readables
    case M_FFC0:
      sf.CP400GraphicMode &=0b11111110;
    break;
    case M_FFC1:
      sf.CP400GraphicMode |=0b00000001;
    break;
    case M_FFC2:
      sf.CP400GraphicMode &=0b11111101;
    break;
    case M_FFC3:
      sf.CP400GraphicMode |=0b00000010;
    break;

    case M_FFC4:
      sf.CP400GraphicMode &=0b11111011;
    break;
    case M_FFC5:
      sf.CP400GraphicMode |=0b00000100;
    break;
    //--------------------Next are Address offset SET/RESET registers--------------------
    case M_FFC6:
      sf.CP400VideoPageOffset_Registers &=0b11111110; //Clear the bit
    break;
    case M_FFC7:
    sf.CP400VideoPageOffset_Registers |=0b00000001; //Set the bit
    break;
    case M_FFC8:
      sf.CP400VideoPageOffset_Registers &=0b11111101; //Clear the bit
    break;
    case M_FFC9:
    sf.CP400VideoPageOffset_Registers |=0b00000010; //Set the bit
    break;
    case M_FFCA:
      sf.CP400VideoPageOffset_Registers &=0b11111011; //Clear the bit
    break;
    case M_FFCB:
    sf.CP400VideoPageOffset_Registers |=0b00000100; //Set the bit
    break;
    case M_FFCC:
      sf.CP400VideoPageOffset_Registers &=0b11110111; //Clear the bit
    break;
    case M_FFCD:
    sf.CP400VideoPageOffset_Registers |=0b00001000; //Set the bit
    break;
    case M_FFCE:
      sf.CP400VideoPageOffset_Registers &=0b11101111; //Clear the bit
    break;
    case M_FFCF:
    sf.CP400VideoPageOffset_Registers |=0b00010000; //Set the bit
    break;
    case M_FFD0:
      sf.CP400VideoPageOffset_Registers &=0b11011111; //Clear the bit
    break;
    case M_FFD1:
    sf.CP400VideoPageOffset_Registers |=0b00100000; //Set the bit
    break;
    case M_FFD2:
      sf.CP400VideoPageOffset_Registers &=0b10111111; //Clear the bit
    break;
    case M_FFD3:
    sf.CP400VideoPageOffset_Registers |=0b01000000; //Set the bit
    break;

