cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
  #ifdef DEBUG_ALL
  printf(" in: ");
  for(int k=0;k<data_len;k++) {
    printf("0x%02x ", data[k] );
  }
  printf("\n");
#endif

  }

usb_pins_config_t USB_Pins_Config =
{
  DP_P0, DM_P0,
  DP_P1, DM_P1,
  DP_P2, DM_P2,
  DP_P3, DM_P3
};

void Setup_USB(void)
{
    fillKeysStruct();
  
    USH.setOnConfigDescCB( Default_USB_ConfigDescCB );
    USH.setOnIfaceDescCb( Default_USB_IfaceDescCb );
    USH.setOnHIDDevDescCb( Default_USB_HIDDevDescCb );
    USH.setOnEPDescCb( Default_USB_EPDescCb );

    USH.init( USB_Pins_Config, my_USB_DetectCB, my_USB_PrintCB );


}

#define K_ESC 27
#define K_F1 1
#define K_F2 2
#define K_BACKSPACE 8
#define K_APOSTROPHE 39
#define K_ENTER 13
#define K_QUOTE 34
#define K_SPACE 32
#define K_CLEAR 3
#define K_SHIFT 0x82
#define K_CTRL 0x81
#define K_ALT 0x84
#define K_CAPS 0x0a  //SHIFT 0 on CP400

#define K_UP 4
#define K_DOWN 5
#define K_LEFT 6
#define K_RIGHT 7


#define lookupOR_0 0b00000001
#define lookupOR_1 0b00000010
#define lookupOR_2 0b00000100
#define lookupOR_3 0b00001000
#define lookupOR_4 0b00010000
#define lookupOR_5 0b00100000
#define lookupOR_6 0b01000000
#define lookupOR_7 0b10000000

#define lookupAND_0 0b11111110
#define lookupAND_1 0b11111101
#define lookupAND_2 0b11111011
#define lookupAND_3 0b11110111
#define lookupAND_4 0b11101111
#define lookupAND_5 0b11011111
#define lookupAND_6 0b10111111
#define lookupAND_7 0b01111111
void fillKeysStruct(void)
{
    USB_DEV_CONTROL.JOY1_BUTT1 = 1;
    USB_DEV_CONTROL.JOY1_BUTT2 = 1;
    USB_DEV_CONTROL.JOY1_X_AXIS = 31;
    USB_DEV_CONTROL.JOY1_Y_AXIS = 31;
    USB_DEV_CONTROL.JOY2_BUTT1 = 1;
    USB_DEV_CONTROL.JOY2_BUTT2 = 1;
    USB_DEV_CONTROL.JOY2_X_AXIS = 31;
    USB_DEV_CONTROL.JOY2_Y_AXIS = 31;

    
    USB_DEV_CONTROL.PORT_JOY1 = 1;
    USB_DEV_CONTROL.PORT_JOY2 = 2;
    USB_DEV_CONTROL.PORT_KEYBOARD = 0;
    for (uint16_t u=0; u!=256; u++)
    {
        USB_DEV_CONTROL.ScanArray[u] = 0;
    }


    USB_DEV_CONTROL.ScanArray[0x29] = K_ESC;
    USB_DEV_CONTROL.ScanArray[0x3a] = K_F1;
    USB_DEV_CONTROL.ScanArray[0x3b] = K_F2;
    USB_DEV_CONTROL.ScanArray[0x1e] = '1';
    USB_DEV_CONTROL.ScanArray[0x1f] = '2';
    USB_DEV_CONTROL.ScanArray[0x20] = '3';
    USB_DEV_CONTROL.ScanArray[0x21] = '4';
    USB_DEV_CONTROL.ScanArray[0x22] = '5';
    USB_DEV_CONTROL.ScanArray[0x23] = '6';
    USB_DEV_CONTROL.ScanArray[0x24] = '7';
    USB_DEV_CONTROL.ScanArray[0x25] = '8';
    USB_DEV_CONTROL.ScanArray[0x26] = '9';
    USB_DEV_CONTROL.ScanArray[0x27] = '0';
    USB_DEV_CONTROL.ScanArray[0x2d] = '-';
    USB_DEV_CONTROL.ScanArray[0x2e] = '=';
    USB_DEV_CONTROL.ScanArray[0x2a] = K_BACKSPACE;
    USB_DEV_CONTROL.ScanArray[0x14] = 'Q';
    USB_DEV_CONTROL.ScanArray[0x1a] = 'W';
    USB_DEV_CONTROL.ScanArray[0x08] = 'E';
    USB_DEV_CONTROL.ScanArray[0x15] = 'R';
    USB_DEV_CONTROL.ScanArray[0x17] = 'T';
    USB_DEV_CONTROL.ScanArray[0x1c] = 'Y';
    USB_DEV_CONTROL.ScanArray[0x18] = 'U';
    USB_DEV_CONTROL.ScanArray[0x0c] = 'I';
    USB_DEV_CONTROL.ScanArray[0x12] = 'O';
    USB_DEV_CONTROL.ScanArray[0x13] = 'P';
    USB_DEV_CONTROL.ScanArray[0x04] = 'A';
    USB_DEV_CONTROL.ScanArray[0x16] = 'S';
    USB_DEV_CONTROL.ScanArray[0x07] = 'D';
    USB_DEV_CONTROL.ScanArray[0x09] = 'F';
    USB_DEV_CONTROL.ScanArray[0x0a] = 'G';
    USB_DEV_CONTROL.ScanArray[0x0b] = 'H';
    USB_DEV_CONTROL.ScanArray[0x0d] = 'J';
    USB_DEV_CONTROL.ScanArray[0x0e] = 'K';
    USB_DEV_CONTROL.ScanArray[0x0f] = 'L';
    USB_DEV_CONTROL.ScanArray[0x33] = ';';
    USB_DEV_CONTROL.ScanArray[0x34] = K_APOSTROPHE;
    USB_DEV_CONTROL.ScanArray[0x28] = K_ENTER;
    USB_DEV_CONTROL.ScanArray[0x1d] = 'Z';
    USB_DEV_CONTROL.ScanArray[0x1b] = 'X';
    USB_DEV_CONTROL.ScanArray[0x06] = 'C';
    USB_DEV_CONTROL.ScanArray[0x19] = 'V';
    USB_DEV_CONTROL.ScanArray[0x05] = 'B';
    USB_DEV_CONTROL.ScanArray[0x11] = 'N';
    USB_DEV_CONTROL.ScanArray[0x10] = 'M';
    USB_DEV_CONTROL.ScanArray[0x36] = ',';
    USB_DEV_CONTROL.ScanArray[0x37] = '.';
    USB_DEV_CONTROL.ScanArray[0x38] = '/';
    USB_DEV_CONTROL.ScanArray[0x39] = K_CAPS;  //SHIFT 0 on CP400

    USB_DEV_CONTROL.ScanArray[0x52] = K_UP;
    USB_DEV_CONTROL.ScanArray[0x51] = K_DOWN;
    USB_DEV_CONTROL.ScanArray[0x50] = K_LEFT;
    USB_DEV_CONTROL.ScanArray[0x4f] = K_RIGHT;


    USB_DEV_CONTROL.ScanArray[0x80 | 0x1e] = '!';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x1f] = '@';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x20] = '#';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x21] = '$';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x22] = '%';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x23] = '^';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x24] = '&';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x25] = '*';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x26] = '(';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x27] = ')';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x2d] = '_';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x2e] = '+';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x34] = K_QUOTE;
    USB_DEV_CONTROL.ScanArray[0x80 | 0x33] = ':';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x36] = '<';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x37] = '>';
    USB_DEV_CONTROL.ScanArray[0x80 | 0x38] = '?';
    USB_DEV_CONTROL.ScanArray[0x2c] = K_SPACE;
    USB_DEV_CONTROL.ScanArray[0x4c] = K_CLEAR;

    USB_DEV_CONTROL.ScanArray[0x80 | 0x82] = K_SHIFT;
    USB_DEV_CONTROL.ScanArray[0x80 | 0x81] = K_CTRL;
    USB_DEV_CONTROL.ScanArray[0x80 | 0x84] = K_ALT;



}



void UpdateKeyMap(uint8_t * Data)
{
    bool ShiftDisabled = false;
    bool ForceShift = false;
    uint8_t SpecialKey;
    uint8_t KeyTranslated = 0;
    uint8_t loop1;
    SpecialKey = (((Data[0] >> 4) | (Data[0] & 0x0f)) | 0x80);
    for (uint8_t u = 0; u!=8; u++)
    {
        USB_DEV_CONTROL.USB_CP400_Key_Array[u] = 0;
    }
    

    

    //Special keys case
    if (SpecialKey !=0) //If Special key and no key press
    {
        switch (SpecialKey)
        {
        case K_SHIFT:
            USB_DEV_CONTROL.USB_CP400_Key_Array[7] |= lookupOR_6;
            
            break;
        case K_CTRL:
            USB_DEV_CONTROL.USB_CP400_Key_Array[4] |= lookupOR_6;
            break;
        case K_ALT:
            USB_DEV_CONTROL.USB_CP400_Key_Array[3] |= lookupOR_6;
            break;
        default:
            break;
        }
    }
    
