cristianoag/ESP32_CP400/software/esp32_cp400_emulator/src/CP400Emulator.cpp
            //-------------------------------------------
        
        default:
            break;
        }
        if (ShiftDisabled == true)
        {
            USB_DEV_CONTROL.USB_CP400_Key_Array[7] &= lookupAND_6;
        }
        if (ForceShift == true)
        {
            USB_DEV_CONTROL.USB_CP400_Key_Array[7] |= lookupOR_6;
        }
    }

}

void UpdateJoyMap(uint8_t * Data, uint8_t usbNum)
{
    if (usbNum == 1)    //Joystick1
    {
        USB_DEV_CONTROL.JOY1_X_AXIS = (Data[0]>>0);
        USB_DEV_CONTROL.JOY1_Y_AXIS = (Data[1]>>0);
        USB_DEV_CONTROL.JOY1_BUTT1 = ((Data[4]<<3) & 0b10000000);
        USB_DEV_CONTROL.JOY1_BUTT2 = ((Data[4]<<2) & 0b10000000);
        if (USB_DEV_CONTROL.JOY1_BUTT1 !=0)
        {
            USB_DEV_CONTROL.JOY1_BUTT1 = 0;
        }
        else
        {
            USB_DEV_CONTROL.JOY1_BUTT1 = 0x01;
        }
        if (USB_DEV_CONTROL.JOY1_BUTT2 !=0)
        {
            USB_DEV_CONTROL.JOY1_BUTT2 = 0;
        }
        else
        {
            USB_DEV_CONTROL.JOY1_BUTT2 = 0x01;
        }
    }
    else if (usbNum == 2)    //Joystick2
    {
        USB_DEV_CONTROL.JOY2_X_AXIS = (Data[0]>>0);
        USB_DEV_CONTROL.JOY2_Y_AXIS = (Data[1]>>0);
        USB_DEV_CONTROL.JOY2_BUTT1 = ((Data[4]<<3) & 0b10000000);
        USB_DEV_CONTROL.JOY2_BUTT2 = ((Data[4]<<2) & 0b10000000);
        if (USB_DEV_CONTROL.JOY2_BUTT1 !=0)
        {
            USB_DEV_CONTROL.JOY2_BUTT1 = 0;
        }
        else
        {
            USB_DEV_CONTROL.JOY2_BUTT1 = 0x01;
        }
        if (USB_DEV_CONTROL.JOY2_BUTT2 !=0)
        {
            USB_DEV_CONTROL.JOY2_BUTT2 = 0;
        }
        else
        {
            USB_DEV_CONTROL.JOY2_BUTT2 = 0x01;
        }
    }
}

//-----------------End USB CP400 MAP--------------------------------------------
